cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'wix/brew'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'applesimutils'
brew 'autoconf'
brew 'automake'
brew 'byobu'
brew 'carthage'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'docker-compose'
brew 'exiftool'
brew 'fswatch'
brew 'fzf'
brew 'git-lfs'
brew 'git'
brew 'goreman'
brew 'gpg'
brew 'graphicsmagick'
brew 'htop'
brew 'imagemagick', args: ['with-librsvg']
brew 'imageoptim-cli'
brew 'jq'
brew 'kubernetes-cli'
brew 'libexif'
brew 'librsvg'
brew 'make'
brew 'mas'
brew 'ncdu'
brew 'ncurses'
brew 'netcat'
brew 'node-build'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'rsync'
brew 'ruby-build'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'wix/brew/applesimutils'
brew 'x264'
brew 'x265'
brew 'yarn'
brew 'zsh-completions'
brew 'zsh'

# brew 'ffmpeg' - use: brew install ffmpeg $(brew options ffmpeg | grep -vE '\s' | grep -- '--with-' | tr '\n' ' ')
# This is done in scripts/install

# ---------- Casks ----------
cask '1password-cli'
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-ndk'
cask 'android-sdk'
cask 'android-studio'
cask 'asset-catalog-tinkerer'
cask 'bonjour-browser'
cask 'charles'
cask 'chromedriver'
cask 'day-o'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'geekbench'
cask 'genymotion'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2-beta'
cask 'java8'
cask 'kap'
cask 'keepingyouawake'
cask 'licecap'
cask 'little-snitch' # Requires manual install from DMG
cask 'ngrok'
cask 'parallels'
cask 'postico'
cask 'react-native-debugger'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'sizeup'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'zwift'

# ---------- Fonts ----------
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-liberation-mono-for-powerline'
cask 'font-liberation-mono'
cask 'font-liberation-sans'
cask 'font-menlo-for-powerline'
cask 'font-meslo-lg font-input'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-noto-sans'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-ubuntu'

# ---------- Mac App Store ----------
mas 'Apple Configurator 2', id: 1037126344
mas 'DevCleaner', id: 1388020431
mas 'Developer', id: 640199958
mas 'Disk Speed Test', id: 425264550
mas 'Gifox', id: 1082624744
mas 'Gifski', id: 1351639930
mas 'iMovie', id: 408981434
mas 'Paste', id: 967805235
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
