cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'caskroom/versions'
tap 'wix/brew'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'byobu'
brew 'carthage'
brew 'coreutils'
brew 'curl'
brew 'docker-compose'
brew 'exiftool'
# brew 'ffmpeg' - use: brew install ffmpeg $(brew options ffmpeg | grep -vE '\s' | grep -- '--with-' | tr '\n' ' ')
# This is done in scripts/install
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'graphicsmagick'
brew 'htop'
brew 'librsvg'
brew 'imagemagick', args: ['with-librsvg']
brew 'imageoptim-cli'
brew 'jq'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'n'
brew 'ncdu'
brew 'netcat'
brew 'rbenv'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'wix/brew/applesimutils'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

# ---------- Casks ----------
cask '1password'
cask 'android-studio'
cask 'atom'
cask 'alfred'
cask 'charles'
cask 'day-o'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
# cask 'google-chrome-beta' - missing currently
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'java8'
cask 'kap'
cask 'keepingyouawake'
cask 'licecap'
cask 'little-snitch' # Requires manual install from DMG
cask 'mamp'
cask 'numi'
cask 'osxfuse'
cask 'postico'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'sizeup'
cask 'slack'
cask 'spotify'
cask 'superduper'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'

# ---------- Android development ----------
cask 'android-sdk'
cask 'java8'

cask 'xquartz'
cask 'inkscape'

# ---------- Quicklook Plugins ----------
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# ---------- Fonts ----------
cask 'font-menlo-for-powerline'
cask 'font-fira-sans'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-dejavu-sans'
cask 'font-noto-sans'
cask 'font-lato'
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-meslo-lg font-input'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-liberation-mono'
cask 'font-liberation-mono-for-powerline'
cask 'font-liberation-sans'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-raleway font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'

# ---------- Mac App Store ----------
mas 'Paste', id: 967805235
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
