cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'wix/brew'

brew 'ack'
brew 'byobu'
brew 'carthage'
brew 'coreutils'
brew 'curl'
brew 'docker-compose'
brew 'exiftool'
brew 'ext4fuse'
# brew 'ffmpeg' - use: brew install ffmpeg $(brew options ffmpeg | grep -vE '\s' | grep -- '--with-' | tr '\n' ' ')
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'graphicsmagick'
brew 'htop'
brew 'imagemagick'
brew 'imageoptim-cli'
brew 'jq'
brew 'jq'
brew 'kubernetes-cli'
brew 'n'
brew 'ncdu'
brew 'netcat'
brew 'rbenv'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'wix/brew/applesimutils'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'atom'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'imagealpha'
cask 'imageoptim'
cask 'java'
cask 'kap'
cask 'keepingyouawake'
cask 'licecap'
cask 'mamp'
cask 'numi'
cask 'osxfuse'
cask 'postico'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'superduper'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'zwift'
